#문제4) 거스름돈 계산하기 - 10만원 짜리를 넣고 거스름돈 받기 
#      물건값이 총 : 27560 
#      거스름돈 : 72440   
#      50000 -- 1 장 
#      10000 -- 2 장 
#       5000 -- 0 장
#       1000 -- 2 장
#        500 -- 0 개 
#        100 -- 4 개
#         50 -- 0 개
#         10 -- 4 개
#못풀어서 교수님 코드 적어놓음.
#입력 : 사용한 돈
#출력 : 50000, 10000, 5000, ...
#중간계산 : 거스름돈

use_money = int("27560")
change_money = 100000 - use_money

m50000 = change_money // 50000
temp = change_money % 50000 #temporary(임시변수)

m10000 = temp // 10000
temp = temp % 10000

m5000 = temp //5000
temp = temp % 5000

m1000 = temp // 1000
temp = temp % 1000

m100 = temp // 100
temp = temp % 100

m50 = temp // 50
temp = temp % 50

m10 = temp // 10
temp = temp % 10

print("50000 ->", m50000, "장")
print("10000 ->", m10000, "장")
print("5000 ->", m5000, "장")
print("1000 ->", m1000, "장")
print("100 ->", m100, "장")
print("50 ->", m50, "장")
print("10 ->", m10, "장")